'use strict';

module.exports.mockArticles = [{
  "user": `ivanov@example.com`,
  "title": `Как начать программировать`,
  "publicationDate": 1621239403082,
  "announce": `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Это один из лучших рок-музыкантов.`,
  "fullText": `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Это один из лучших рок-музыкантов. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
  "categories": [`Программирование`, `Без рамки`, `Железо`, `IT`, `Музыка`],
  "comments": [{
    "user": `ivanov@example.com`,
    "text": `Мне кажется или я уже читал это где-то?`
  }, {
    "user": `ivanov@example.com`,
    "text": `Это где ж такие красоты?  Согласен с автором!`
  }, {
    "user": `ivanov@example.com`,
    "text": `Мне кажется или я уже читал это где-то?`
  }, {
    "user": `ivanov@example.com`,
    "text": `Плюсую, но слишком много буквы! Согласен с автором! `
  }]
}, {
  "user": `petrov@example.com`,
  "title": `Обзор новейшего смартфона`,
  "publicationDate": 1621031911901,
  "announce": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
  "fullText": `Золотое сечение — соотношение двух величин, гармоническая пропорция. Программировать не настолько сложно, как об этом говорят. Ёлки — это не просто красивое дерево. Это прочная древесина. Собрать камни бесконечности легко, если вы прирожденный герой. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Как начать действовать? Для начала просто соберитесь.`,
  "categories": [`Разное`, `Кино`],
  "comments": [{
    "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного... Это где ж такие красоты?`
  }, {
    "user": `petrov@example.com`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "user": `petrov@example.com`,
    "text": `Согласен с автором! Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
  }]
}, {
  "user": `ivanov@example.com`,
  "title": `Ёлки. История деревьев`,
  "publicationDate": 1622786915465,
  "announce": `Первая большая ёлка была установлена только в 1938 году.`,
  "fullText": `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина. Простые ежедневные упражнения помогут достичь успеха. Собрать камни бесконечности легко, если вы прирожденный герой. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Первая большая ёлка была установлена только в 1938 году. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Программировать не настолько сложно, как об этом говорят. Достичь успеха помогут ежедневные повторения. Это один из лучших рок-музыкантов. Как начать действовать? Для начала просто соберитесь. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Золотое сечение — соотношение двух величин, гармоническая пропорция. Из под его пера вышло 8 платиновых альбомов. Он написал больше 30 хитов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  "categories": [`За жизнь`, `Железо`],
  "comments": [{
    "user": `ivanov@example.com`,
    "text": `Хочу такую же футболку :-) Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }, {
    "user": `ivanov@example.com`,
    "text": `Мне кажется или я уже читал это где-то? Совсем немного...`
  }, {
    "user": `ivanov@example.com`,
    "text": `Это где ж такие красоты? Плюсую, но слишком много буквы!`
  }, {
    "user": `ivanov@example.com`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
  }]
}, {
  "user": `petrov@example.com`,
  "title": `Что такое золотое сечение`,
  "publicationDate": 1616799273828,
  "announce": `Программировать не настолько сложно, как об этом говорят. Первая большая ёлка была установлена только в 1938 году. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  "fullText": `Достичь успеха помогут ежедневные повторения. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Первая большая ёлка была установлена только в 1938 году.`,
  "categories": [`Разное`, `Программирование`, `За жизнь`, `Музыка`, `Железо`, `IT`, `Без рамки`],
  "comments": [{
    "user": `petrov@example.com`,
    "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Плюсую, но слишком много буквы! `
  }, {
    "user": `petrov@example.com`,
    "text": `Плюсую, но слишком много буквы! Это где ж такие красоты?`
  }, {
    "user": `petrov@example.com`,
    "text": `Мне кажется или я уже читал это где-то?`
  }]
}, {
  "user": `ivanov@example.com`,
  "title": `Как начать программировать`,
  "publicationDate": 1619007830026,
  "announce": `Из под его пера вышло 8 платиновых альбомов. Первая большая ёлка была установлена только в 1938 году. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  "fullText": `Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
  "categories": [`Программирование`, `За жизнь`, `Музыка`, `Железо`, `IT`, `Без рамки`, `Кино`, `Разное`, `Деревья`],
  "comments": [{
    "user": `ivanov@example.com`,
    "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Это где ж такие красоты? Планируете записать видосик на эту тему?`
  }, {
    "user": `ivanov@example.com`,
    "text": `Совсем немного...  Плюсую, но слишком много буквы!`
  }]
}];

module.exports.mockCategories = [`Программирование`, `Без рамки`, `Железо`, `IT`, `Музыка`, `Разное`, `Кино`, `За жизнь`, `Деревья`];
